hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_adc16_regs.h
/*
 * PRD (RW)
 *
 * conver period, with prescale.
 * Set to 0 means disable current channel
 */
#define ADC16_PRD_CFG_PRD_CFG_PRD_MASK (0xFFU)
#define ADC16_PRD_CFG_PRD_CFG_PRD_SHIFT (0U)
#define ADC16_PRD_CFG_PRD_CFG_PRD_SET(x) (((uint32_t)(x) << ADC16_PRD_CFG_PRD_CFG_PRD_SHIFT) & ADC16_PRD_CFG_PRD_CFG_PRD_MASK)
#define ADC16_PRD_CFG_PRD_CFG_PRD_GET(x) (((uint32_t)(x) & ADC16_PRD_CFG_PRD_CFG_PRD_MASK) >> ADC16_PRD_CFG_PRD_CFG_PRD_SHIFT)

/* Bitfield definition for register of struct array PRD_CFG: PRD_THSHD_CFG */
/*
 * THSHDH (RW)
 *
 * threshold high, assert interrupt(if enabled) if result exceed high or low.
 */
#define ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDH_MASK (0xFFFF0000UL)
#define ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDH_SHIFT (16U)
#define ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDH_SET(x) (((uint32_t)(x) << ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDH_SHIFT) & ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDH_MASK)
#define ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDH_GET(x) (((uint32_t)(x) & ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDH_MASK) >> ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDH_SHIFT)

/*
 * THSHDL (RW)
 *
 * threshold low
 */
#define ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDL_MASK (0xFFFFU)
#define ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDL_SHIFT (0U)
#define ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDL_SET(x) (((uint32_t)(x) << ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDL_SHIFT) & ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDL_MASK)
#define ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDL_GET(x) (((uint32_t)(x) & ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDL_MASK) >> ADC16_PRD_CFG_PRD_THSHD_CFG_THSHDL_SHIFT)

/* Bitfield definition for register of struct array PRD_CFG: PRD_RESULT */
/*
 * CHAN_RESULT (RO)
 *
 * adc convert result, update after each valid conversion.
 * it may be updated period according to config, also may be updated due to other queue convert the same channel
 */
#define ADC16_PRD_CFG_PRD_RESULT_CHAN_RESULT_MASK (0xFFFFU)
#define ADC16_PRD_CFG_PRD_RESULT_CHAN_RESULT_SHIFT (0U)
#define ADC16_PRD_CFG_PRD_RESULT_CHAN_RESULT_GET(x) (((uint32_t)(x) & ADC16_PRD_CFG_PRD_RESULT_CHAN_RESULT_MASK) >> ADC16_PRD_CFG_PRD_RESULT_CHAN_RESULT_SHIFT)

/* Bitfield definition for register array: SAMPLE_CFG */
/*
 * SAMPLE_CLOCK_NUMBER_SHIFT (RW)
 *
 * shift for sample clock number
 */
#define ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT_MASK (0xE00U)
#define ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT_SHIFT (9U)
#define ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT_SET(x) (((uint32_t)(x) << ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT_SHIFT) & ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT_MASK)
#define ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT_GET(x) (((uint32_t)(x) & ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT_MASK) >> ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT_SHIFT)

/*
 * SAMPLE_CLOCK_NUMBER (RW)
 *
 * sample clock number, base on clock_period, default one period
 */
#define ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_MASK (0x1FFU)
#define ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT (0U)
#define ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SET(x) (((uint32_t)(x) << ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT) & ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_MASK)
#define ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_GET(x) (((uint32_t)(x) & ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_MASK) >> ADC16_SAMPLE_CFG_SAMPLE_CLOCK_NUMBER_SHIFT)

/* Bitfield definition for register: CONV_CFG0 */
/*
 * FULL_RESOLUTION (RW)
 *
 * in differential mode, if result is less than 0, then output 0;
 */
#define ADC16_CONV_CFG0_FULL_RESOLUTION_MASK (0x8U)
#define ADC16_CONV_CFG0_FULL_RESOLUTION_SHIFT (3U)
#define ADC16_CONV_CFG0_FULL_RESOLUTION_SET(x) (((uint32_t)(x) << ADC16_CONV_CFG0_FULL_RESOLUTION_SHIFT) & ADC16_CONV_CFG0_FULL_RESOLUTION_MASK)
#define ADC16_CONV_CFG0_FULL_RESOLUTION_GET(x) (((uint32_t)(x) & ADC16_CONV_CFG0_FULL_RESOLUTION_MASK) >> ADC16_CONV_CFG0_FULL_RESOLUTION_SHIFT)

/*
 * POS_MODE (RW)
 *
 * 0:  result is from -32768 to +32767(result 0 if two adc results are same );
 * 1:  result is from 0 to 65535 (result 32768 if two adc results are same );
 */
#define ADC16_CONV_CFG0_POS_MODE_MASK (0x4U)
#define ADC16_CONV_CFG0_POS_MODE_SHIFT (2U)
#define ADC16_CONV_CFG0_POS_MODE_SET(x) (((uint32_t)(x) << ADC16_CONV_CFG0_POS_MODE_SHIFT) & ADC16_CONV_CFG0_POS_MODE_MASK)
#define ADC16_CONV_CFG0_POS_MODE_GET(x) (((uint32_t)(x) & ADC16_CONV_CFG0_POS_MODE_MASK) >> ADC16_CONV_CFG0_POS_MODE_SHIFT)

/*
 * DIFF_MASTER (RW)
 *
 * set to act as master, will use the result of current adc minus another adc result as final result.
 * Refer to soc UM for which is the another adc.
 */
#define ADC16_CONV_CFG0_DIFF_MASTER_MASK (0x2U)
#define ADC16_CONV_CFG0_DIFF_MASTER_SHIFT (1U)
#define ADC16_CONV_CFG0_DIFF_MASTER_SET(x) (((uint32_t)(x) << ADC16_CONV_CFG0_DIFF_MASTER_SHIFT) & ADC16_CONV_CFG0_DIFF_MASTER_MASK)
#define ADC16_CONV_CFG0_DIFF_MASTER_GET(x) (((uint32_t)(x) & ADC16_CONV_CFG0_DIFF_MASTER_MASK) >> ADC16_CONV_CFG0_DIFF_MASTER_SHIFT)

/*
 * ADC_DIFF_MODE (RW)
 *
 * set to enable differential mode
 */
#define ADC16_CONV_CFG0_ADC_DIFF_MODE_MASK (0x1U)
#define ADC16_CONV_CFG0_ADC_DIFF_MODE_SHIFT (0U)
#define ADC16_CONV_CFG0_ADC_DIFF_MODE_SET(x) (((uint32_t)(x) << ADC16_CONV_CFG0_ADC_DIFF_MODE_SHIFT) & ADC16_CONV_CFG0_ADC_DIFF_MODE_MASK)
#define ADC16_CONV_CFG0_ADC_DIFF_MODE_GET(x) (((uint32_t)(x) & ADC16_CONV_CFG0_ADC_DIFF_MODE_MASK) >> ADC16_CONV_CFG0_ADC_DIFF_MODE_SHIFT)

/* Bitfield definition for register: CONV_CFG1 */
/*
 * CONVERT_CLOCK_NUMBER (RW)
 *
 * convert clock numbers, set to 21 (0x15) for 16bit mode, which means convert need 21 adc clock cycles(based on clock after divider);
 * user can use small value to get faster conversion, but less accuracy, need to config cov_end_cnt at adc16_config1 also.
 * Ex: use 200MHz bus clock for adc, set sample_clock_number to 4, sample_clock_number_shift to 0, covert_clk_number to 21 for 16bit mode, clock_divider to 3, then each ADC conversion(plus sample) need 25 cycles(50MHz).
 */
#define ADC16_CONV_CFG1_CONVERT_CLOCK_NUMBER_MASK (0x1F0U)
#define ADC16_CONV_CFG1_CONVERT_CLOCK_NUMBER_SHIFT (4U)
#define ADC16_CONV_CFG1_CONVERT_CLOCK_NUMBER_SET(x) (((uint32_t)(x) << ADC16_CONV_CFG1_CONVERT_CLOCK_NUMBER_SHIFT) & ADC16_CONV_CFG1_CONVERT_CLOCK_NUMBER_MASK)
#define ADC16_CONV_CFG1_CONVERT_CLOCK_NUMBER_GET(x) (((uint32_t)(x) & ADC16_CONV_CFG1_CONVERT_CLOCK_NUMBER_MASK) >> ADC16_CONV_CFG1_CONVERT_CLOCK_NUMBER_SHIFT)

