hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_adc16_regs.h
/*
 * CAL_AVG_CFG (RW)
 *
 * for average the calibration result.
 * 0- 1 loop;   1- 2 loops;   2- 4 loops;   3- 8 loops;
 * 4- 16 loops;  5-32 loops;   others reserved
 */
#define ADC16_ADC16_CONFIG0_CAL_AVG_CFG_MASK (0x700000UL)
#define ADC16_ADC16_CONFIG0_CAL_AVG_CFG_SHIFT (20U)
#define ADC16_ADC16_CONFIG0_CAL_AVG_CFG_SET(x) (((uint32_t)(x) << ADC16_ADC16_CONFIG0_CAL_AVG_CFG_SHIFT) & ADC16_ADC16_CONFIG0_CAL_AVG_CFG_MASK)
#define ADC16_ADC16_CONFIG0_CAL_AVG_CFG_GET(x) (((uint32_t)(x) & ADC16_ADC16_CONFIG0_CAL_AVG_CFG_MASK) >> ADC16_ADC16_CONFIG0_CAL_AVG_CFG_SHIFT)

/*
 * PREEMPT_EN (RW)
 *
 * set to enable preemption feature
 */
#define ADC16_ADC16_CONFIG0_PREEMPT_EN_MASK (0x4000U)
#define ADC16_ADC16_CONFIG0_PREEMPT_EN_SHIFT (14U)
#define ADC16_ADC16_CONFIG0_PREEMPT_EN_SET(x) (((uint32_t)(x) << ADC16_ADC16_CONFIG0_PREEMPT_EN_SHIFT) & ADC16_ADC16_CONFIG0_PREEMPT_EN_MASK)
#define ADC16_ADC16_CONFIG0_PREEMPT_EN_GET(x) (((uint32_t)(x) & ADC16_ADC16_CONFIG0_PREEMPT_EN_MASK) >> ADC16_ADC16_CONFIG0_PREEMPT_EN_SHIFT)

/*
 * CONV_PARAM (RW)
 *
 * conversion parameter
 */
#define ADC16_ADC16_CONFIG0_CONV_PARAM_MASK (0x3FFFU)
#define ADC16_ADC16_CONFIG0_CONV_PARAM_SHIFT (0U)
#define ADC16_ADC16_CONFIG0_CONV_PARAM_SET(x) (((uint32_t)(x) << ADC16_ADC16_CONFIG0_CONV_PARAM_SHIFT) & ADC16_ADC16_CONFIG0_CONV_PARAM_MASK)
#define ADC16_ADC16_CONFIG0_CONV_PARAM_GET(x) (((uint32_t)(x) & ADC16_ADC16_CONFIG0_CONV_PARAM_MASK) >> ADC16_ADC16_CONFIG0_CONV_PARAM_SHIFT)

/* Bitfield definition for register: ADC16_CONFIG1 */
/*
 * COV_END_CNT (RW)
 *
 * used for faster conversion, user can change it to get higher convert speed(but less accuracy).
 * should set to (21-convert_clock_number+1).
 */
#define ADC16_ADC16_CONFIG1_COV_END_CNT_MASK (0x1F00U)
#define ADC16_ADC16_CONFIG1_COV_END_CNT_SHIFT (8U)
#define ADC16_ADC16_CONFIG1_COV_END_CNT_SET(x) (((uint32_t)(x) << ADC16_ADC16_CONFIG1_COV_END_CNT_SHIFT) & ADC16_ADC16_CONFIG1_COV_END_CNT_MASK)
#define ADC16_ADC16_CONFIG1_COV_END_CNT_GET(x) (((uint32_t)(x) & ADC16_ADC16_CONFIG1_COV_END_CNT_MASK) >> ADC16_ADC16_CONFIG1_COV_END_CNT_SHIFT)



/* CONFIG register group index macro definition */
#define ADC16_CONFIG_TRG0A (0UL)
#define ADC16_CONFIG_TRG0B (1UL)
#define ADC16_CONFIG_TRG0C (2UL)
#define ADC16_CONFIG_TRG1A (3UL)
#define ADC16_CONFIG_TRG1B (4UL)
#define ADC16_CONFIG_TRG1C (5UL)
#define ADC16_CONFIG_TRG2A (6UL)
#define ADC16_CONFIG_TRG2B (7UL)
#define ADC16_CONFIG_TRG2C (8UL)
#define ADC16_CONFIG_TRG3A (9UL)
#define ADC16_CONFIG_TRG3B (10UL)
#define ADC16_CONFIG_TRG3C (11UL)

/* BUS_RESULT register group index macro definition */
#define ADC16_BUS_RESULT_CHN0 (0UL)
#define ADC16_BUS_RESULT_CHN1 (1UL)
#define ADC16_BUS_RESULT_CHN2 (2UL)
#define ADC16_BUS_RESULT_CHN3 (3UL)
#define ADC16_BUS_RESULT_CHN4 (4UL)
#define ADC16_BUS_RESULT_CHN5 (5UL)
#define ADC16_BUS_RESULT_CHN6 (6UL)
#define ADC16_BUS_RESULT_CHN7 (7UL)
#define ADC16_BUS_RESULT_CHN8 (8UL)
#define ADC16_BUS_RESULT_CHN9 (9UL)
#define ADC16_BUS_RESULT_CHN10 (10UL)
#define ADC16_BUS_RESULT_CHN11 (11UL)
#define ADC16_BUS_RESULT_CHN12 (12UL)
#define ADC16_BUS_RESULT_CHN13 (13UL)
#define ADC16_BUS_RESULT_CHN14 (14UL)
#define ADC16_BUS_RESULT_CHN15 (15UL)

/* SEQ_QUE register group index macro definition */
#define ADC16_SEQ_QUE_CFG0 (0UL)
#define ADC16_SEQ_QUE_CFG1 (1UL)
#define ADC16_SEQ_QUE_CFG2 (2UL)
#define ADC16_SEQ_QUE_CFG3 (3UL)
#define ADC16_SEQ_QUE_CFG4 (4UL)
#define ADC16_SEQ_QUE_CFG5 (5UL)
#define ADC16_SEQ_QUE_CFG6 (6UL)
#define ADC16_SEQ_QUE_CFG7 (7UL)
#define ADC16_SEQ_QUE_CFG8 (8UL)
#define ADC16_SEQ_QUE_CFG9 (9UL)
#define ADC16_SEQ_QUE_CFG10 (10UL)
#define ADC16_SEQ_QUE_CFG11 (11UL)
#define ADC16_SEQ_QUE_CFG12 (12UL)
#define ADC16_SEQ_QUE_CFG13 (13UL)
#define ADC16_SEQ_QUE_CFG14 (14UL)
#define ADC16_SEQ_QUE_CFG15 (15UL)

/* PRD_CFG register group index macro definition */
#define ADC16_PRD_CFG_CHN0 (0UL)
#define ADC16_PRD_CFG_CHN1 (1UL)
#define ADC16_PRD_CFG_CHN2 (2UL)
#define ADC16_PRD_CFG_CHN3 (3UL)
#define ADC16_PRD_CFG_CHN4 (4UL)
#define ADC16_PRD_CFG_CHN5 (5UL)
#define ADC16_PRD_CFG_CHN6 (6UL)
#define ADC16_PRD_CFG_CHN7 (7UL)
#define ADC16_PRD_CFG_CHN8 (8UL)
#define ADC16_PRD_CFG_CHN9 (9UL)
#define ADC16_PRD_CFG_CHN10 (10UL)
#define ADC16_PRD_CFG_CHN11 (11UL)
#define ADC16_PRD_CFG_CHN12 (12UL)
#define ADC16_PRD_CFG_CHN13 (13UL)
#define ADC16_PRD_CFG_CHN14 (14UL)
#define ADC16_PRD_CFG_CHN15 (15UL)

/* SAMPLE_CFG register group index macro definition */
#define ADC16_SAMPLE_CFG_CHN0 (0UL)
#define ADC16_SAMPLE_CFG_CHN1 (1UL)
#define ADC16_SAMPLE_CFG_CHN2 (2UL)
#define ADC16_SAMPLE_CFG_CHN3 (3UL)
#define ADC16_SAMPLE_CFG_CHN4 (4UL)
#define ADC16_SAMPLE_CFG_CHN5 (5UL)
#define ADC16_SAMPLE_CFG_CHN6 (6UL)
#define ADC16_SAMPLE_CFG_CHN7 (7UL)
#define ADC16_SAMPLE_CFG_CHN8 (8UL)
#define ADC16_SAMPLE_CFG_CHN9 (9UL)
#define ADC16_SAMPLE_CFG_CHN10 (10UL)
#define ADC16_SAMPLE_CFG_CHN11 (11UL)
#define ADC16_SAMPLE_CFG_CHN12 (12UL)
#define ADC16_SAMPLE_CFG_CHN13 (13UL)
#define ADC16_SAMPLE_CFG_CHN14 (14UL)
#define ADC16_SAMPLE_CFG_CHN15 (15UL)

/* ADC16_PARAMS register group index macro definition */
#define ADC16_ADC16_PARAMS_ADC16_PARA00 (0UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA01 (1UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA02 (2UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA03 (3UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA04 (4UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA05 (5UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA06 (6UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA07 (7UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA08 (8UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA09 (9UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA10 (10UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA11 (11UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA12 (12UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA13 (13UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA14 (14UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA15 (15UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA16 (16UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA17 (17UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA18 (18UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA19 (19UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA20 (20UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA21 (21UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA22 (22UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA23 (23UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA24 (24UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA25 (25UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA26 (26UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA27 (27UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA28 (28UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA29 (29UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA30 (30UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA31 (31UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA32 (32UL)
#define ADC16_ADC16_PARAMS_ADC16_PARA33 (33UL)


#endif /* HPM_ADC16_H */
